#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным


number = int(input('Введите число: '))

if number == 6:
    print('Выходной')
elif number == 7:
    print('Выходной')
else:
    print('Нет')